{
    "technologies_used": "Technologies utilisées :",
    "section_presentation": "Présentation",
    "section_projects": "Projets",
    "section_contact": "Contact",
    
    "presentation_role": "Ingénieur en développement logiciel",
    "presentation_description": "J'aime tout ce qui est lié à la programmation, comme la création de sites web, d'applications (PC~~et~~mobiles), de scripts d'automatisation, de jeux vidéo, de logiciels pour systèmes embarqués, etc.",
    
    "project_lps_title": "Labyrinth Path Solver",
    "project_lps_description": "Labyrinth Path Solver est un projet conçu lors d'un cours d'algorithme et de structure de données. Ce projet permet de visualiser la génération et la résolution de labyrinthes, le tout à l'aide d'une interface graphique interactive.",
    "project_lps_technologies": "HTML, CSS, JavaScript (canvas, contexte~~2D)",
    "project_lps_see_below": "Vous pouvez directement intéragir avec le générateur de labyrinthes ci-dessous :",
    
    "lps_generation_configuration": "Configuration de génération",
    "lps_inner_radius": "Rayon interne",
    "lps_outer_radius": "Rayon externe",
    "lps_paths_density": "Densité des chemins",
    "lps_traveled_distance": "Distance parcourue",
    "lps_shortest_solution": "Solution la plus courte",
    "lps_button_regenerate": "Générer un autre avec la même configuration",
    "lps_animation_configuration": "Configuration de l'animation",
    "lps_show_solution": "Afficher la solution",
    "lps_preview_type": "Type de prévisualisation",
    "lps_preview_type_show_progress": "Afficher progression",
    "lps_preview_type_instant": "Instantanée",
    "lps_generation_speed": "Vitesse de génération",
    "lps_resolve_speed": "Vitesse de résolution",
    "lps_export": "Export",
    "lps_export_unresolved": "Labyrinthe non-résolue en PNG",
    "lps_export_resolved": "Labyrinthe résolue en PNG",
    "lps_export_current_state": "État actuel du labyrinthe en PNG",
    
    "project_bachelor_title": "Projet de Bachelor",
    "project_bachelor_description_intro": "Le projet de bachelor, réalisé individuellement, consiste en deux parties distinctes :",
    "project_bachelor_part1": "Utilitaire permettant la génération de labyrinthes",
    "project_bachelor_part2": "Jeu en 3D permettant de parcourir des labyrinthes générés",
    "project_bachelor_description1_1": "L'utilitaire, inspiré du projet <em>Labyrinth Path Solver</em> décrit ci-dessus, permet de générer et de visualiser des labyrinthes composés de zones isolées appelées <em>clusters</em> (chaque cluster est représenté par une couleur distincte).",
    "project_bachelor_description1_2": "Les clusters sont ensuite reliés entre eux par des téléporteurs de manière à ce que chaque cluster soit accessible (chaque paire de téléporteurs est représentée par une lettre).",
    "project_bachelor_description1_3": "Un labyrinthe est composé de multiples salles, chaque salle ayant une difficulté qui y est associée (représenté par un nombre de 0 à 100), plus la salle est proche de l'arrivée, plus sa difficulté est élevée.",
    "project_bachelor_description1_4": "Les labyrinthes générés peuvent être enregistrés en tant que fichiers JSON. Un algorithme permet de déterminer le niveau de difficulté global d'un labyrinthe.",
    "project_bachelor_description2_1": "Le jeu en 3D permet de parcourir une succession de labyrinthes de difficulté croissante.",
    "project_bachelor_description2_2": "De multiples salles composées d'obstacles doivent être parcourues, les obstacles variant en fonction de la difficulté de la salle.",
    "project_bachelor_description2_3": "Le joueur peut en tout temps voir la carte du labyrinthe, permettant de connaitre sa localisation actuelle et l'emplacement des téléporteurs. Cependant, le joueur ne sait pas où mènent les téléporteurs. Il doit donc identifier la difficulté de la salle pour savoir s'il se rapproche ou s'éloigne de l'arrivée.",
    "project_bachelor_description2_4": "Le joueur dispose de trois points de vie. S'il tombe dans le vide, il perd une vie et réapparait à l'entrée de la salle actuelle. S'il perd tous ses points de vie, c'est game over ; le nombre de labyrinthes parcourus représente le score du joueur.",
    "project_bachelor_technologies_used1": "Technologies utilisées pour l'utilitaire :",
    "project_bachelor_technologies1": "Python, Tkinter (interface graphique), JSON",
    "project_bachelor_technologies_used2": "Technologies utilisées pour le jeu en 3D :",
    "project_bachelor_technologies2": "Godot (moteur de jeu), Blender (modélisation~~3D), JSON",
    
    "project_gf_title": "Grafile",
    "project_gf_description": "Grafile est un logiciel conçu pour automatiser certaines actions sur des fichiers, telles que les renommer, les déplacer, les supprimer, etc. L'interface graphique est sous la forme d'un système de nœuds pouvant être reliés entre eux.",
    "project_gf_technologies": "C++, Qt",
    
    "project_pa_title": "PixelARC",
    "project_pa_description1": "PixelARC est un langage de programmation conçu pour permettre la génération d'images dans le style \"pixel&nbsp;art\".",
    "project_pa_description2": "Le projet est composé de deux grandes parties :",
    "project_pa_part1": "Le compilateur (convertit le code PixelARC en bytecode)",
    "project_pa_part2": "L'interpréteur (interprète le bytecode et génère l'image finale)",
    "project_pa_description3": "Le langage implémente certains concepts tels que les variables, les conditions, les boucles, les fonctions, etc.<br>Des fonctions \"natives\" sont aussi implémentées, telles que des fonctions trigonométriques et des fonctions permettant de dessiner sur l'image finale.",
    "project_pa_technologies": "Python, Numpy, Pillow, Ply, PyDot",
    
    "project_aq_title": "Arquizz",
    "project_aq_description": "Arquizz est un site web inspiré de <i>Kahoot!</i> permettant de créer et de jouer à des quiz en ligne en affrontant d'autres utilisateurs en temps réel. Le projet implémente les fonctionnalités suivantes :",
    "project_aq_feat1": "Gestion d'utilisateurs (inscription, connexion, profil)",
    "project_aq_feat2": "Gestion des quiz (création, modification, suppression)",
    "project_aq_feat3": "Gestion des questions et des propositions",
    "project_aq_feat4": "Système de salons (partie publique pouvant être rejointe par n'importe qui via un code)",
    "project_aq_feat5": "Système de points et de classement pour une partie",
    "project_aq_feat6": "Système de temporisation pour une partie (limite de temps par question)",
    "project_aq_feat_etc": "etc.",
    "project_aq_technologies": "HTML, CSS, JavaScript, PHP, Laravel, MySQL",
    
    "project_background_title": "Arrière plan du portfolio",
    "project_background_description": "L'arrière plan de ce site est une de mes créations conçue spécialement pour ce portfolio. Différentes notions d'OpenGL/WebGL sont implémentées, telles que les vertex shaders, les fragment shaders, les textures, l'upscaling, le post-processing, etc.",
    "project_background_technologies": "HTML, CSS, JavaScript, WebGL",
    "project_background_see_below": "Vous pouvez modifier l'arrière-plan à l'aide des boutons ci-dessous :",
    
    "background_theme_default": "Par défaut",
    "background_theme_honey": "Miel",
    "background_theme_blueberry_jam": "Confiture aux myrtilles",
    "background_theme_lava": "Lave",
    "background_theme_neon": "Néon",
    "background_theme_rusty_metal": "Métal rouillé",
    
    "project_more_title": "... et bien plus !",
    "project_more_description": "Durant mes études, j'ai conçu de nombreux autres projets, aussi bien individuellement que en groupe.<br>Seuls quelques projets clés sont décrits sur ce portfolio.",
    
    "contact_text": "Vous pouvez me contacter par e-mail ou sur LinkedIn.",
    "contact_email_text": "M'envoyer un e-mail",
    "contact_linkedin_text": "Me trouver sur LinkedIn"
}
